#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_ALL, "RUS");
	printf("1 \n \t 2 \n \t\t 3");
	printf("\n%26d%3d%3d%3d", 1, 2, 3, 4);
	printf("\n\n%10.5f\n", 12.234657);
	printf("\nОстаток от деления %d на %d равен %1.1f\n ", 5, 2, 5.0 / 2);
	printf("\n%d / %d = %1.1f\n ", 7, 5, 7.0 / 5);
	printf("\n%d * %d = %d\n ", 2000, 4, 2000 * 4);
	printf("\n%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000);
	printf("%g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000);
	printf("%e разделить %e равно %e\n ", 5., 2000000., 5. / 2000000);
	printf("%f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000);
	printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000);
}